In [2]:
import pandas as pd

# Series one diamation | DataFrame | Arithmetic Operations | Insert |Delete

# Series one diamation

In [7]:
x=[3,4,5,6,7,8]
var = pd.Series(x)
print(var)
print(type(var)) #to check if this series is belogto pandas or not

0    3
1    4
2    5
3    6
4    7
5    8
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
print(var[2]) #index number

5

In [10]:
y=[3,4,5,6]
var = pd.Series(y,index=['a','b','c','d'])
var1 = pd.Series(y,index=['a','b','c','d'],dtype="float") #to change the datatype #type casting
print(var)
print(var1)

a    3
b    4
c    5
d    6
dtype: int64
a    3.0
b    4.0
c    5.0
d    6.0
dtype: float64

In [12]:
y=[3,4,5,6]
var1 = pd.Series(y,index=['a','b','c','d'],dtype="float", name="python")#to give a data to name 
print(var1)

a    3.0
b    4.0
c    5.0
d    6.0
Name: python, dtype: float64

In [17]:
dic = {"name":['python','c','c++','java'],"por":[12,13,14,15],"rank":[1,4,3,2]}
var = pd.Series(dic)
var #else print(var)

name    [python, c, c++, java]
por           [12, 13, 14, 15]
rank              [1, 4, 3, 2]
dtype: object

In [18]:
s= pd.Series(12,index=[1,2,3,4,5,6,7])
print(s)
print(type(s))

1    12
2    12
3    12
4    12
5    12
6    12
7    12
dtype: int64
<class 'pandas.core.series.Series'>

In [20]:
s= pd.Series(12,index=[1,2,3,4,5,6,7])
s2= pd.Series(12,index=[1,2,3,4])
print(s+s2)

1    24.0
2    24.0
3    24.0
4    24.0
5     NaN
6     NaN
7     NaN
dtype: float64

# DataFrame

In [21]:
import pandas as pd

In [24]:
l=[1,2,3,4,5,6,7]
var = pd.DataFrame(l)
print(var)
print(type(var))

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
<class 'pandas.core.frame.DataFrame'>

In [46]:
d = {"A":[1,2,3,4,5],"S":[6,7,8,9,10],"d":[1,2,3,4,5],1:["a","b","c","d","e"]}
var = pd.DataFrame(d)
print(var)
print(type(var))

   A   S  d  1
0  1   6  1  a
1  2   7  2  b
2  3   8  3  c
3  4   9  4  d
4  5  10  5  e
<class 'pandas.core.frame.DataFrame'>

In [30]:
d = {"A":[1,2,3,4,5],"S":[6,7,8,9,10],"d":[1,2,3,4,5],1:["a","b","c","d","e"]}
var = pd.DataFrame(d,columns=["A",1]) #to print a particular column only
print(var)
print(type(var))

   A  1
0  1  a
1  2  b
2  3  c
3  4  d
4  5  e
<class 'pandas.core.frame.DataFrame'>

In [34]:
d = {"A":[1,2,3,4,5],"S":[6,7,8,9,10],"d":[1,2,3,4,5],1:["a","b","c","d","e"]}
var = pd.DataFrame(d,columns=["A",1],index=["a",1,"vishwa","c","sagar"]) #to change the index or index number
print(var)
print(type(var))

        A  1
a       1  a
1       2  b
vishwa  3  c
c       4  d
sagar   5  e
<class 'pandas.core.frame.DataFrame'>

In [38]:
d = {"A":[1,2,3,4,5],"S":[6,7,8,9,10],"d":[1,2,3,4,5],1:["a","b","c","d","e"]}
var = pd.DataFrame(d) 

print(var["A"][3])#to find a data of particular column and raw print(var[column][raw])

4

In [41]:
list = [[1,2,3,4,5],[11,12,13,14,15]]
var3 = pd.DataFrame(list)
print(var3)
print(type(var3))

    0   1   2   3   4
0   1   2   3   4   5
1  11  12  13  14  15
<class 'pandas.core.frame.DataFrame'>

In [43]:
sr = {"s": pd.Series([1,2,3,4]),"r": pd.Series([1,2,3,4])}
var3 = pd.DataFrame(sr)
print(var3)
print(type(var3))

   s  r
0  1  1
1  2  2
2  3  3
3  4  4
<class 'pandas.core.frame.DataFrame'>

# Arithmetic Operations

In [44]:
import pandas as pd

In [45]:
var = pd.DataFrame({"A":[1,2,3,4,5],"S":[6,7,8,9,10]})
var

   A   S
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [50]:
var = pd.DataFrame({"A":[1,2,3,4,5],"S":[6,7,8,9,10]})
var["C"] = var["A"]+var["S"]
var["D"] = var["A"]-var["S"]
var["E"] = var["A"]*var["S"]
var["E"] = var["A"]/var["S"]
var

   A   S   C  D         E
0  1   6   7 -5  0.166667
1  2   7   9 -5  0.285714
2  3   8  11 -5  0.375000
3  4   9  13 -5  0.444444
4  5  10  15 -5  0.500000

In [51]:
var1 = pd.DataFrame({"A":[10,20,30,40,50],"S":[16,17,18,19,10]})
var1

    A   S
0  10  16
1  20  17
2  30  18
3  40  19
4  50  10

In [55]:
var1["C"] = var1["A"] <= 20
var1["D"] = var1["A"] >=15
var1["E"] = var1["A"] ==30
var1["E"] = var1["A"] !=30
var1

    A   S      C      D      E
0  10  16   True  False   True
1  20  17   True   True   True
2  30  18  False   True  False
3  40  19  False   True   True
4  50  10  False   True   True

# Insert

In [56]:
import pandas as pd

In [57]:
var = pd.DataFrame({"A":[1,2,3,4,5],"S":[6,7,8,9,10]})
var

   A   S
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [63]:
var = pd.DataFrame({"A":[1,2,3,4,5],"S":[6,7,8,9,10]})
var.insert(1,"python",var["A"]) #datainsert #index number,position and name,data

var

   A  python   S
0  1       1   6
1  2       2   7
2  3       3   8
3  4       4   9
4  5       5  10

In [64]:

var.insert(1,"python_1",[11,12,13,14,15]) #datainsert #index number,position and name,data

var

   A  python_1  python   S
0  1        11       1   6
1  2        12       2   7
2  3        13       3   8
3  4        14       4   9
4  5        15       5  10

In [67]:
var = pd.DataFrame({"A":[1,2,3,4,5],"S":[6,7,8,9,10]})
var["python_12"]= var["A"][:3] #can use any column to copy data
var

   A   S  python_12
0  1   6        1.0
1  2   7        2.0
2  3   8        3.0
3  4   9        NaN
4  5  10        NaN

# Delete

In [69]:
import pandas as pd

In [82]:

var = pd.DataFrame({"A":[1,2,3,4,5],"S":[6,7,8,9,10],"c":[1,2,3,4,5]})
var.pop("c")
var

   A   S
0  1   6
1  2   7
2  3   8
3  4   9
4  5  10

In [83]:
#else # both functions are same pop and del
var = pd.DataFrame({"A":[1,2,3,4,5],"S":[6,7,8,9,10],"c":[1,2,3,4,5]})
del var["A"]
var

    S  c
0   6  1
1   7  2
2   8  3
3   9  4
4  10  5